tests/regression_tests/expression_bdd_dot/xor_chain.dot
digraph bdd {
  rankdir=TB;
  "node000" [label = "a", name = "node000", rank = "0", shape = "circle", style = "filled"];
  "node001" [label = "b", name = "node001", rank = "1", shape = "circle", style = "filled"];
  "node002" [label = "b", name = "node002", rank = "1", shape = "circle", style = "filled"];
  "node003" [label = "c", name = "node003", rank = "2", shape = "circle", style = "filled"];
  "node004" [label = "c", name = "node004", rank = "2", shape = "circle", style = "filled"];
  "node005" [label = "d", name = "node005", rank = "3", shape = "circle", style = "filled"];
  "node006" [label = "d", name = "node006", rank = "3", shape = "circle", style = "filled"];
  "node007" [label = "e", name = "node007", rank = "4", shape = "circle", style = "filled"];
  "node008" [label = "e", name = "node008", rank = "4", shape = "circle", style = "filled"];
  "node009" [label = "0", fillcolor = "lightgray", name = "node009", rank = "5", shape = "box", style = "filled"];
  "node010" [label = "1", fillcolor = "lightgray", name = "node010", rank = "5", shape = "box", style = "filled"];
  "node000" -> "node001" [style = "dashed"];
  "node000" -> "node002" [style = "solid"];
  "node001" -> "node003" [style = "solid"];
  "node001" -> "node004" [style = "dashed"];
  "node002" -> "node003" [style = "dashed"];
  "node002" -> "node004" [style = "solid"];
  "node003" -> "node005" [style = "solid"];
  "node003" -> "node006" [style = "dashed"];
  "node004" -> "node005" [style = "dashed"];
  "node004" -> "node006" [style = "solid"];
  "node005" -> "node007" [style = "solid"];
  "node005" -> "node008" [style = "dashed"];
  "node006" -> "node007" [style = "dashed"];
  "node006" -> "node008" [style = "solid"];
  "node007" -> "node009" [style = "solid"];
  "node007" -> "node010" [style = "dashed"];
  "node008" -> "node009" [style = "dashed"];
  "node008" -> "node010" [style = "solid"];
}
